 # EX1
 
# n = input('Введите строку:\n')
# n1 = s[:len(s)//2 if len(s)%2 == 0 else (((len(s)//2))+1):]
# n2 = s[len(s)//2 if len(s)%2 == 0 else (((len(s)//2))+1)::]
# print('1 подстрока:', n1)
# print('2 подстрока:',n2)
# s3 = s2[::-1] + s1[::-1]
# print('переворачиваем строку:', s3)
#EX2
# s = input('Введите строку:\n')
# print("*".join(s))

#EX3
 
# p = input('Введите целое число: ')
# p1 = tuple(p)
# print('Кортеж из числа:', p1)

#EX4
# t = (1,7,5,3,6,8,2,4,9)
# print(f'Кортеж: {t}')
# t1 = sorted(t)
# for i in range(len(t)):
#    if t[i] != t1[i]:
#        print('ERROR!')
#Практика

#EX1
# list_1 = []
# while list_1.count('0') == 0:
#     list_1.append(input('Введите новый элемент списка: '))
# else:
#     list_1.remove('0')
# print(f'Ваш спискок: {list_1}')
# print('Список только с четными индексами:',list_1[0:-1:2])
#
#EX2
# string_input = input('Введите строку: \n')
# list_1 = string_input.split()
# print('Ваш список:\n',list_1)
# list_1 = list_1[0:-1:2]
# print('Список с четными элементами:\n', list_1)
#
#EX3
# sum = 0
# l1 = [input(f'Элемент № {i+1}: ') for i in range(int(input('Введите количество элементов в списке: ')))]
# print(f'\nВаш список: {l1}')
# for i in l1:
#     if i.isdigit():
#         sum = sum + int(i)
# print(f'\n Сумма всех ЧИСЛОВЫХ элементов вашего списка = {sum}')
#
#
#Cписки
#

# list_1 = ['131121',, '789', '345', '03', '632', '1588']
# print(f'Исходный список: {list_1}')
# num_1 = input('Какую цифру будем искать внутри эелементов списка: ')
# check = []
# for i in list_1:
#     if num_1 in i:
#         check.append(i)
# print(f'Цифра: {num_1} встречается в элементах: {check}')






# list_1 = input("Введите элементы списка через запятую: ").split(',')
# for i in range(0, len(list_1)-1, 2):
#     list_1[i], list_1[i+1] = list_1[i+1], list_1[i]
# print('Измененный список:', ','.join(list_1))
 
 
 
# len_l1 = int(input('Введите длину списка: '))
# l1 = input('Введите элементы списка через запятую:\n').split(',')
# step = 1
# l1 = l1[-step:] + l1[:-step]
# print(f'Список со смещением: {l1}')




#EX1
# str_1 = input('Введите любую строку:\n')
# print('Количество уникальных символов в строке:', len(set(str_1)))
#
#EX2
# l1 = set([4,2,3,4,5,6,7,7,7,8,9,9])
# l2 = set([4,1,1,2,2,2,2,3,3,4,5,6])
# l1.intersection_update(l2)
# print('Числа, входящие только в один список: ', sorted(l1))
#
#Ex3
# list_1 = input('Вводите числа через пробел: ').split()
# # В цикле проходим по всем элементам list_1
# for i in range(len(list_1)):
#     # Присваиваем переменной end значение списка list_1 [начало : конец : шаг], каждую итерацию спиоск увеличивается на один элемент
#     end = list_1[:i:]
#     # Првоеряем условие: входит ли значение list_1[i] в список end
#     if list_1[i] in end:
#         print(list_1[i], '- вводилась ранее')
#     else:
#         print(list_1[i], '- еще не вводилась')
#

#Словари
# import re
# text = '''\nРаз@!#рабо$#!тчики ,,, .... !!!! $#!\n
# язы$!ка Pyt@#!@hon     \n     .... при@дер$!@!#живаются опред!@#@!#елённой
# фил@!#$ософии програ!@#!@#ммиро@!#!вания,          называе$#!мой «Th#@!#e
# Ze$!@n of Pyth@!#on» («Дз!#!@#ен Пито@!#!@#на», или \t
# «Дзе!@#!@#н\n  !!!!    Пайто!@$#!на»). Е#@!е текст вы!@#!@#$%даётся
# интерпре!@#!@#татором   .?>/.   \n      Pyt@$!!hon по
# коман!@#!@#де impor!#!@#t !!!&&&!! /// ,,, <?
# thi!#@#s (раб!@#!@#отает од$!@$ин ра$#$!@з з$!@$@!#а \n
# се$!@#!@#сси!@#!@#ю).\t'''
# dict_1 = {}
# text = text.split()
# for word in text:
#     word = re.sub("[^A-ZА-яa-zа-я0-9]", "", word)
#     if word != '':
#         dict_1[word] = dict_1.get(word, 0) + 1
# print('| Кол-во |   Слово   |')
# for key, value in dict_1.items():
#     print(f'{value} \t\t {key}')
